In [2]:
#영화타이틀 데이터셋  > 구글드라이브에서 다운로드 


import pandas as pd
import numpy as np

url = 'C:/Users/chois/0.choishiam/movies_title.csv'
titles = pd.read_csv(url)

In [3]:
#df 필수명령 8가지 

# german.head : 불러온 데이터의 상위 5개의 행을 출력
# german.shape : 데이터의 (행, 열) 크기를 확인
# german.columns : df의 컬럼명을 모두 출력
# german.info() : 데이터프래임 구조 확인
# german.tail() : 마지막 n개의 데이터 확인
# german.isnull().sum() : 결측치 확인
# german.describe() : 요약통계 확인
# german["Purpose"].value_counts() : 중복요소 수 세기 (히스토그램)

titles.head()

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015

In [40]:
titles.shape

(215981, 2)

In [41]:
titles.columns

Index(['title', 'year'], dtype='object')

In [42]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215981 entries, 0 to 215980
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   215981 non-null  object
 1   year    215981 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.3+ MB

In [43]:
titles.tail()

                      title  year
215976       Le mouton noir  1922
215977  Edge of the Unknown  2015
215978                E yue  2005
215979         Lakota Girls  2015
215980         The Sting II  1983

In [44]:
titles.isnull()

        title   year
0       False  False
1       False  False
2       False  False
3       False  False
4       False  False
...       ...    ...
215976  False  False
215977  False  False
215978  False  False
215979  False  False
215980  False  False

[215981 rows x 2 columns]

In [45]:
titles.isnull().sum()

title    0
year     0
dtype: int64

In [46]:
titles.describe()

                year
count  215981.000000
mean     1984.553822
std        29.343957
min      1894.000000
25%      1965.000000
50%      1994.000000
75%      2010.000000
max      2024.000000

In [47]:
titles["year"].value_counts()

2015    13978
2014     8209
2013     7664
2012     7273
2011     6844
        ...
1899        2
2024        2
1903        1
1897        1
1894        1
Name: year, Length: 124, dtype: int64

In [48]:
#전체 영화는 몇개인가?  >> 215981개

len(titles["title"].values)

215981

In [49]:
#가장 빠른 시기에 제작된 영화 2개를 찾아라. 

titles.sort_values(by="year").head(2)

                                                    title  year
165182                                         Miss Jerry  1894
85708   Reproduction of the Corbett and Fitzsimmons Fight  1897

In [50]:
#제목이 "Hamlet"인 영화는 몇개인가? 
titles

                          title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]

In [59]:
#제목이 "Hamlet"인 영화는 몇개인가?   19개
is_Hamlet = titles["title"] == "Hamlet"
hamlet = titles[is_Hamlet]
hamlet.count()

title    19
year     19
dtype: int64

In [60]:
#제목이 "Treasure Island"는 몇개인가? 제작년도 오름차순으로 나열  >> 8개

In [62]:
is_treasure = titles["title"] == "Treasure Island"
treasure = titles[is_treasure]
treasure.sort_values(by="year")

                  title  year
191379  Treasure Island  1918
47769   Treasure Island  1920
192917  Treasure Island  1934
90175   Treasure Island  1950
104714  Treasure Island  1972
103646  Treasure Island  1973
190792  Treasure Island  1985
166675  Treasure Island  1999

In [71]:
len(treasure)

8

In [70]:
#1950년에서 1959년사이에 만들어진 영화는 몇개인가?  >> 12120개

titles[(titles['year']>=1950)& (titles['year'] <1960)].count()

title    12120
year     12120
dtype: int64